wordpress/wp-content/themes/woodlandwoman-dev/todo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-26 Thu 18:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="heat" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge5cd848">1. Jen's Blog Refresh To-do</a>
<ul>
<li><a href="#org4da94e5">1.1. Sections</a>
<ul>
<li><a href="#org0778e4f">1.1.1. Site Structure</a></li>
<li><a href="#orgaa9a44c">1.1.2. Style</a></li>
<li><a href="#org853ee7b">1.1.3. Functions</a></li>
</ul>
</li>
<li><a href="#orgbc46690">1.2. Misc</a>
<ul>
<li><a href="#orgdc8d0fe">1.2.1. <span class="todo TODO">TODO</span> Mail integration</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orge5cd848" class="outline-2">
<h2 id="orge5cd848"><span class="section-number-2">1</span> Jen's Blog Refresh To-do</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4da94e5" class="outline-3">
<h3 id="org4da94e5"><span class="section-number-3">1.1</span> Sections</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org0778e4f" class="outline-4">
<h4 id="org0778e4f"><span class="section-number-4">1.1.1</span> Site Structure</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="orgbb5b77b"></a><span class="done DONE">DONE</span> Development environment<br />
<ol class="org-ol">
<li><a id="org43db3c8"></a>Emacs<br />
<div class="outline-text-6" id="text-1-1-1-1-1">
<ul class="org-ul">
<li>All text editing: PHP, JavaScript, HTML, CSS, SCSS. Using intelephense as a PHP LSP.</li>
</ul>
</div>
</li>
<li><a id="org7194b53"></a>Docker and docker-compose<br />
<div class="outline-text-6" id="text-1-1-1-1-2">
<ul class="org-ul">
<li>Running containers for MySQL database, Nginx server, and WordPress installation.</li>
</ul>
</div>
</li>
<li><a id="org36bd778"></a>WPGulp<br />
<div class="outline-text-6" id="text-1-1-1-1-3">
<ul class="org-ul">
<li>Auto-reloading, css and js compilation and minification.</li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="orgdd424d6"></a><span class="done DONE">DONE</span> Project structure<br />
<div class="outline-text-5" id="text-1-1-1-2">
<ul class="org-ul">
<li>Based on underscore <a href="https://underscores.me">https://underscores.me</a></li>
</ul>
<pre class="example">
./
├── 404.php
├── archive.php
├── comments.php
├── footer.php
├── functions.php
├── gulpfile.babel.js
├── header.php
├── img
├── inc
│   ├── custom-header.php
│   ├── customizer.php
│   ├── jetpack.php
│   ├── template-functions.php
│   └── template-tags.php
├── index.php
├── js
│   ├── customizer.js
│   ├── navigation.js
│   └── skip-link-focus-fix.js
├── LICENSE
├── package.json
├── package-lock.json
├── page.php
├── phpcs.xml.dist
├── README.md
├── readme.txt
├── screenshot.png
├── scss
│   ├── elements
│   ├── forms
│   ├── layout
│   ├── media
│   ├── mixins
│   ├── modules
│   ├── navigation
│   ├── _normalize.scss
│   ├── site
│   ├── style.scss
│   ├── typography
│   └── variables-site
├── search.php
├── sidebar.php
├── single.php
├── style.css
├── style.css.map
├── style.min.css
├── template-parts
│   ├── content-none.php
│   ├── content-page.php
│   ├── content.php
│   └── content-search.php
└── wpgulp.config.js
</pre>
</div>
</li>
<li><a id="orgbf705f7"></a><span class="done DONE">DONE</span> Normalization<br />
<div class="outline-text-5" id="text-1-1-1-3">
<ul class="org-ul">
<li>Used normalize scss package to standardize certain font and other css settings according to modern standards.</li>
</ul>
</div>
</li>
<li><a id="orgfdc3c9c"></a><span class="done DONE">DONE</span> Database migration<br /></li>
<li><a id="orgdc37391"></a><span class="todo TODO">TODO</span> Sidebar and basic frame<br />
<ol class="org-ol">
<li><a id="org19a8feb"></a><span class="todo TODO">TODO</span> Blogroll<br />
<div class="outline-text-6" id="text-1-1-1-5-1">
<ul class="org-ul">
<li>Two large posts (featured or latest)</li>
<li>Grid of 4x2 older posts with thumbnail, date, title, excerpt, READ MORE.</li>
</ul>
</div>
</li>
<li><a id="org3a9683c"></a><span class="todo TODO">TODO</span> Horizontal Instagram feed across whole page.<br /></li>
<li><a id="org1842f0d"></a><span class="todo TODO">TODO</span> Sidebar<br />
<div class="outline-text-6" id="text-1-1-1-5-3">
<ul class="org-ul">
<li>WRITER &amp; RESEARCHER</li>
<li>Hello and welcome section.</li>
<li>Sign up for my newsletter</li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="org4fde8dd"></a><span class="todo TODO">TODO</span> Archive view<br />
<div class="outline-text-5" id="text-1-1-1-6">
<ul class="org-ul">
<li>By category and date, then within.</li>
</ul>
</div>
</li>
<li><a id="orgec727cf"></a><span class="todo TODO">TODO</span> Single post view<br />
<div class="outline-text-5" id="text-1-1-1-7">
<ul class="org-ul">
<li>Wider photos</li>
<li>Larger font</li>
<li>No sidebar visible</li>
</ul>
</div>
</li>
<li><a id="org476d2f7"></a><span class="todo TODO">TODO</span> Menu<br />
<div class="outline-text-5" id="text-1-1-1-8">
<ul class="org-ul">
<li>Home, Activities, Environment, How To, Reviews, About</li>
</ul>
</div>
</li>
<li><a id="orgbe3bd62"></a><span class="todo TODO">TODO</span> Footer<br />
<div class="outline-text-5" id="text-1-1-1-9">
<ul class="org-ul">
<li>Left-aligned: WEBSITE TERMS, PRIVACY, CONTACT ME, (C)Jenna Amirault</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgaa9a44c" class="outline-4">
<h4 id="orgaa9a44c"><span class="section-number-4">1.1.2</span> Style</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="org0f35bd4"></a><span class="todo TODO">TODO</span> Fonts<br /></li>
<li><a id="orgbe6c8a7"></a><span class="todo TODO">TODO</span> Header<br /></li>
<li><a id="org7870590"></a><span class="todo TODO">TODO</span> Widths<br /></li>
<li><a id="org3b2c4eb"></a><span class="todo TODO">TODO</span> Grid using CSS grid for different sections of pages<br /></li>
</ol>
</div>
<div id="outline-container-org853ee7b" class="outline-4">
<h4 id="org853ee7b"><span class="section-number-4">1.1.3</span> Functions</h4>
<div class="outline-text-4" id="text-1-1-3">
</div>
<ol class="org-ol">
<li><a id="org0e49faa"></a>JavaScript<br />
<ol class="org-ol">
<li><a id="org73de957"></a><span class="todo TODO">TODO</span> Social media share clickable menu<br />
<div class="outline-text-6" id="text-1-1-3-1-1">
<ul class="org-ul">
<li>make it smaller and nicer and from scratch</li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="org08e575f"></a>PHP<br />
<ol class="org-ol">
<li><a id="org4508697"></a><span class="todo TODO">TODO</span> Return full size post preview<br />
<div class="outline-text-6" id="text-1-1-3-2-1">
<ul class="org-ul">
<li>Front page-based</li>
<li>Category-based</li>
</ul>
</div>
</li>
<li><a id="org2f78f7b"></a><span class="todo TODO">TODO</span> Return grid size post preview<br /></li>
<li><a id="org263e0f4"></a><span class="todo TODO">TODO</span> Return full post<br /></li>
<li><a id="orgbe6d887"></a><span class="todo TODO">TODO</span> Return full page<br /></li>
<li><a id="orgbd44161"></a><span class="todo TODO">TODO</span> Return sidebar contents<br /></li>
<li><a id="orgfe80bef"></a><span class="todo TODO">TODO</span> Return footer contents<br /></li>
<li><a id="org4122882"></a><span class="todo TODO">TODO</span> Return comment contents<br /></li>
<li><a id="orgad42957"></a><span class="todo TODO">TODO</span> Return comment enter window<br /></li>
<li><a id="org0f2b322"></a><span class="todo TODO">TODO</span> Pagination<br /></li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgbc46690" class="outline-3">
<h3 id="orgbc46690"><span class="section-number-3">1.2</span> Misc</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgdc8d0fe" class="outline-4">
<h4 id="orgdc8d0fe"><span class="section-number-4">1.2.1</span> <span class="todo TODO">TODO</span> Mail integration</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: heat</p>
<p class="date">Created: 2019-12-26 Thu 18:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
